# Задача 2: 
# Найдите сумму цифр трехзначного числа. 
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

# a = int(input("Введите 3х значное число: "))
# c = a % 10
# b = a // 10
# n = b % 10
# m = b // 10
# if a > 99 and a < 1000:
#     print(c + n + m)
# else:
#     print("Введите 3-х значное число")


a = int(input("Введите 3х значное число: "))

sum = 0
if a > 99 and a < 1000:
    while a>=1:
        sum += a%10
        a =a//10
    print(sum)
else:
    print("Введите 3х значное число: ")    